let jokes = [
    "শীতের সকালে স্বামীর অভিমান শীতের সকাল, স্ত্রী গোসল করে বের হতেই স্বামীর সামনে পড়লো। স্বামীও তখন গোসলে যাচ্ছিলো। স্ত্রীকে বাথরুম থেকে বের হতে দেখে স্বামী তার দিকে তাকিয়ে আছে অপলক দৃষ্টিতে। স্ত্রী খুব রোমান্টিক মুডে বললো— স্ত্রী: কী দেখছো অমন করে? স্বামী: দেখতেছি আমার গোসলের জন্য রাখা গরম পানিটুকু শেষ কইরা আইলা তুমি!",
    "মেয়েদের বয়স জানার উপায় বাসে খালি সিটে বসা নিয়ে দুই নারী ঝগড়া করছিল। কন্ডাক্টর কোনো যুক্তিতেই তাদের দমাতে পারছিল না। শেষে একটা সহজ বুদ্ধি এলো তার মাথায়- কন্ডাক্টর: দুই আপারেই কইতাছি, আপনাগোর মধ্যে যিনি বয়সে বড় তিনি বসে যাবেন সিটে! এ কথার পর হঠাৎ সবাইকে অবাক করে দিয়ে ঝগড়া বন্ধ! দুই নারীর কেউই আর বসলেন না সিটে। মুখে কথা নেই, সারা রাস্তা তারা দাঁড়িয়ে পার করলেন।",
    "শালি ছাড়া বিয়ে করবে না ছেলে ছেলের বিয়ের কথাবার্তা চলছে। হঠাৎ ছেলে বাবার কাছে আবদার করলো— ছেলে: বাবা, একটা কথা। বাবা: কী কথা? ছেলে: আমি শালি ছাড়া বিয়ে করবো না। বাবা: কেন? ছেলে: কারণ আমার বন্ধুদেরও হক আছে।",
    "শালি ছাড়া বিয়ে করবে না ছেলে ছেলের বিয়ের কথাবার্তা চলছে। হঠাৎ ছেলে বাবার কাছে আবদার করলো— ছেলে: বাবা, একটা কথা। বাবা: কী কথা? ছেলে: আমি শালি ছাড়া বিয়ে করবো না। বাবা: কেন? ছেলে: কারণ আমার বন্ধুদেরও হক আছে।",
    "স্ত্রীর নাম ভুলে যাওয়ার পরিণাম আদালতে এক নারীর স্বামী হত্যার বিচার চলছে। জজ সাহেব সেই নারীকে জিজ্ঞাসা করলেন- জজ সাহেব: হত্যা করার রাতে আপনার স্বামী শেষ কী বলেছিলেন? স্ত্রী: আমার চশমা কোথায় সুপর্ণা? জজ সাহেব: শুধু এ কথা বলাতে আপনি আপনার স্বামীকে খুন করলেন? স্ত্রী: জজ সাহেব, আমার নাম পাপিয়া। জজ সাহেব: ওহ!",
    "প্রেমিকার আবদার মেটালো প্রেমিক রিয়া ও শফিক অনেক দিন থেকেই প্রেম করছে। এখন শফিক রিয়াকে বিয়ে করতে চায়। তবে তার আগে রিয়ার কিছু আবদার আছে- রিয়া: আমাকে বিয়ে করতে হলে তোমাকে সিগারেট খাওয়া ছাড়তে হবে। শফিক: ছেড়ে দিলাম। রিয়া: বিয়ার খাওয়া ছেড়ে দাও। শফিক: ছেড়ে দিলাম। রিয়া: কথা দাও আর কোনো মিথ্যা কথা বলবে না। শফিক: কথা দিলাম। রিয়া: এবার বলো আমায় বিয়ে করবে? শফিক: না। রিয়া: কেন? শফিক: এখন যেহেতু অনেক ভালো হয়ে গেছি, নিশ্চয়ই তোমার থেকে অনেক ভালো মেয়ে পাব! তাহলে আর তোমাকে বিয়ে করব কেন?",
    "স্ত্রীর নিশানা একদম ঠিক স্বামী: জজ সাহেব, আমি আমার স্ত্রীর কাছে ডিভোর্স চাই, সে থালা-বাসন ছুড়ে মারে। জজ: সবে বাসন ছুড়ে মারতে শুরু করেছেন নাকি আগেও মারতেন। স্বামী: আগে থেকেই। বিচারক: তাহলে এত বছর পর ডিভোর্স কেন?স্বামী: কারণ এখন তার নিশানা একদম ঠিক জায়গায় লাগছে।",
    "প্রতিবেশীর চেঁচামেচির যন্ত্রণা এক বাড়িতে ডাকাতি হয়েছে। প্রতিবেশীর বাড়িতে অনুসন্ধানের কাজে গেছেন গোয়েন্দা। গোয়েন্দা: গত রাতে পাশের বাসা থেকে আপনারা কোনো শব্দ শুনতে পেয়েছেন? প্রতিবেশী: নাহ! গোলাগুলি, চিৎকার আর ওদের কুকুরটার চেঁচামেচির যন্ত্রণায় কিছু শোনাই যাচ্ছিল না!",
    "নিশ্বাস নিতে ভুলে গেলে বাড়ির মালিক মারা গেছেন। চাকর হাউমাউ করে কাঁদছে। প্রতিবেশীরা এসেছে দেখতে। একজন চাকরকে জিজ্ঞাস করলেন— প্রতিবেশী: কী হয়েছিল তোমার মালিকের? চাকর: ভারি ভুলোমনা মানুষ ছিলেন তিনি। বোধ হয় গত রাতে নিশ্বাস নিতে ভুলে গেছিলেন।",
    "ছেলের বুদ্ধি দেখে বাবা অবাক বাচ্চা: বাবা আমাদের নতুন প্রতিবেশী খুব গরিব? বাবা: তুমি জানলে কীভাবে? বাচ্চা: ওদের ছেলে এক টাকার কয়েন গিলে ফেলেছে, কাঁদতে কাঁদতে মায়ের অবস্থা খারাপ হয়ে যাচ্ছে!",
    "স্ত্রীর নিশানা একদম ঠিক স্বামী: জজ সাহেব, আমি আমার স্ত্রীর কাছে ডিভোর্স চাই, সে বাসন ছুড়ে মারে। জজ: সবে বাসন ছুড়ে মারতে শুরু করেছেন নাকি আগেও মারতেন।স্বামী: আগে থেকেই বিচারক: তাহলে এত বছর পর ডিভোর্স কেন?স্বামী: কারণ এখন তার নিশানা একদম ঠিক জায়গায় লাগছে।",
    "স্ত্রীর রূপের আগুন স্বামী: আজকে এই রুটিগুলো কীভাবে পুড়িয়েছে? স্ত্রী: কারণ আমি দিনে দিনে সুন্দর হয়ে যাচ্ছি। স্বামী: তোমার সুন্দর হওয়ার সঙ্গে পোড়া রুটির কী সম্পর্ক? স্ত্রী: আমার সৌন্দর্য দেখে রুটিও জ্বলতে শুরু করেছে।",
    "প্রেমিকাকে ইনস্টলমেন্টে ভোলার উপায় ছ্যাঁকা খাওয়া এক প্রেমিককে সান্ত্বনা দিয়ে বন্ধু বলল, ‘আরে দূর, মলি কোনো মেয়ে হলো? ওর মতো মেয়েকে ভুলতে কয় দিন লাগে? তুই আবার মনের মতো কাউকে পেয়ে যাবি।’ হতাশ প্রেমিক দীর্ঘশ্বাস ছেড়ে বলল, ‘ভোলার উপায় নাই রে, গত মাসে আমি ওকে ইনস্টলমেন্টে অনেক কিছু কিনে দিয়েছি।’",
    "বেশি খরচে বিয়ে করার সুবিধা এক লোক বিবাহ বিচ্ছেদ করতে উকিলের কাছে গেল। উকিল মামলার জন্য দশ হাজার টাকা দাবি করলেন— লোকটি বললো: বিয়ের সময় পুরোহিত নিয়েছিল মাত্র একশ টাকা। এখন দেখছি সস্তার তিন অবস্থা!",
    "চার মাস পর বাড়ির কর্তা তার নতুন কাজের লোক কে বলছেন— বাড়ির কর্তা: ঠিক আছে তুমি আজ থেকে কাজে লেগে যাও প্রতিদিন ২০ টাকা করে পাবে। চার মাস পর থেকে 80 টাকা করে পাবে। কাজের লোক: আমি তাহলে চার মাস পরেই আসবো।",
    "পরকীয়ায় সিদ্ধহস্ত স্ত্রী তার স্বামীর ফোন চেক করে এবং কয়েকটি সন্দেহজনক নাম খুঁজে পায়। – আমার জীবন – আমার পাগলী – আমার স্বপ্নের রাণী সে রাগান্বিত হয়ে পড়ে এবং প্রথম নাম্বারটিতে ফোন করে। দেখে এটা তার শাশুড়ী। তারপর সে দ্বিতীয় নাম্বারটি কল করে। স্বামীর ছোট বোন জবাব দিল। যখন সে তৃতীয় নামটিতে কল করে, দেখে তার নিজের ফোনটিতে রিং হচ্ছে তখন! তিনি তার নির্দোষ স্বামীকে সন্দেহ করে আসছেন বলে খুব মন কষ্ট পেলেন। চোখ গড়িয়ে জল পড়া পর্যন্ত থামলেন না, প্রিয় স্বামীর স্বপ্নের রাণী, ড্রিম গার্ল। তারপর সিদ্ধান্ত নিলেন, বেচারা স্বামীর প্রতি এমন আচরণের হিসেবে তিনি তার এ মাসের বেতনের পুরো টাকাটা স্বামীর হাতে তুলে দেবেন। স্বামী টাকাটা গ্রহণ করলেন এবং তার গার্লফ্রেন্ডকে একটি দামী উপহারও কিনে দিলেন, যার নাম ফোনে সেভ করা ছিল– “গফুর ভাই রাজমিস্ত্রি”।",
    "বলতে পারো লিগাল আর লজিকাল কথাটির পার্থক্য। এক ছাত্র উঠে বললেন, স্যার আপনার বয়স 60 বছর।আপনার স্ত্রী র বয়স 20। এটি লিগাল। কিন্তু লজিক্যাল নয়। আর এক ছাত্রের উওর স্যার আপনার স্ত্রী 25 বছরের এক যুবকের সঙ্গে সম্পর্কে জড়িয়ে গেলেন। এট লজিক্যাল, কিন্তু লিগাল নয়। শিক্ষক মহাশয় ক্লাশ ছেড়ে সেই যে নিরুদ্দেশ হলেন, এখনো সন্ধান মেলেনি।",
    "সুমন রাস্তা দিয়ে যাচ্ছিল, একটি মেয়েকে দেখে তার ভালো লেগে গেল, সে মেয়েটাকে দেখে চেঁচিয়ে বলল- I love you, এটি শুনে মেয়েটি সুমনের কাছে এসে, জোরে একটা চড় মেরে দিয়ে বলল- “কি বললি?” সুমন গালে হাত ঘষতে ঘষতে মেয়েটাকেও জোরে চড় মেরে দিয়ে বলল, “যদি শুনইনি, তাহলে চড় কেন মাড়লে?",
    "আমাদের গ্রামের গুড্ডুর প্রশ্নঃ- “Apple, Microsoft, Facebook, Amazon বড় বড় কোম্পানি গুলির মালিক তো সবই ছেলে, তাহলে মেয়েরা পরীক্ষায় এত নাম্বার পেয়ে করেটা কি?” পাশ থেকে টুনুর উত্তরঃ- “কি আর করবে, মেক-আপ কিনে নষ্ট করে হয়ত",
    "পতি পত্নীর ঝগড়া হয়ে গেছে, প্রায় অর্ধেকটা দিন কেউই কারো সাথে কোনো কথা বলল না। বিকেলের দিকে পত্নী স্বামীর কাছে এসে বলল, “দেখ এভাবে ঝগড়া করে, মুখ গোমড়া করে বসে থেকে লাভ নেই। আমাদের সমস্যা আমাদেরই মিটিয়ে নিতে হবে। তাই তুমি কিছুটা compromise কর আমি কিছুটা করি।” এটি শুনে স্বামী বলল- “ঠিক আছে, আমাকে কি করতে হবে?"
];


let button = document.getElementsByTagName("button");
let container = document.querySelector("#content");
let p = document.querySelector("#p")

let cpu = Math.floor(Math.random() * jokes.length)
container.innerHTML = jokes[cpu];

let jokesg = () => {
    cpu = Math.round(Math.random() * jokes.length)
    container.innerHTML = jokes[cpu];

    console.log(cpu)
}
jokesg()